# -*- coding: utf-8 -*-
"""
Created on Tue Mar 10 22:12:49 2020
學習重點
1. 要會區分布林值、整數、浮點數、字串
2. 要明白程式的邏輯順序
3. 會使用運算符號+-*/ // % **
4. 一點點知道邏輯運算子，比較運算子，in 與is 運算子
5. 字串單引號、雙引號的使用與差別。
6. 
@author: e010
"""

#==============================================================================
#Python 資料型別
'''布林值'''
print(bool(1))
print(bool(0))
print(bool(()))
'''整數'''
print(int(100))
print(int(3.14))
#字串轉整數
print(int('100',2))
'''浮點數'''
print(float(1))
print(float(3.14))
#字串轉浮點數
print(float('3.1415'))
'''字串'''
s= str('Python')
s1= 'Python 1'
s2= "Python 2"
#==============================================================================
#變數未定義
print(x)
#定義x
x=1
print(x)
#x大小寫有區別
print(X)
#變數運算
y=x+2
print(y)
#運算子==============================================================================
'''指定運算子'''
z=1+2
'''算術運算子'''

"""請練習+-*/ // % ** """

'''比較運算子'''
A=5<2
B=5<=5
C=5>2
D=5>=2
E=5!=2
F=5==2
'''邏輯運算子'''
x1=True
x2=False
y1=True
y2=False
andx1y1=x1 and y1
andx1y2=x1 and y2
andx2y1=x2 and y1
andx2y2=x2 and y2
#練習or與not

'''in 與is 運算子'''

x = [1,2,3]
x1= 1
y = [1,2,3]
print(x1 in y)
print(x in y)

print(x is y)
print(x1 is y)
#練習not in, is not

'''位元運算子 & | ^ ~ << >>'''
#從二進位角度來比一個位置做邏輯運算
#電腦將數字轉為二進位，並做邏輯運算
'''
1&1=1
1&0=0
0&0=0
0&1=0
1|1=1
1|0=0
0|1=0
0|0=0
1^1=0
1^0=1
0^1=1
0^0=0
'''
A1=5&4
A2=5|4
A3=5^4
#位元取相反
A4=~5
#將二進位往左移兩個位元移動後補零
A5=5<<2
#將二進位往右移兩個位元移動後補零
A6=5>>2
'''運算子優先權次序'''
#請參考投影片31-33頁，程式寫久了就會知道優先順序，但初學的時候請多花一點心思記憶。
#==============================================================================
#字串
'''字串運算子'''
#單引號
string1 = '春眠不覺曉，處處聞啼鳥。'
print(string1)
#雙引號
string2 = "夜來風雨聲，花落知多少。"
print(string2)
#字串使用雙引號
string3 = '作者"孟浩然" 詩名"春曉"'
print(string3)
#字串使用單引號
string4 = "作者'孟浩然' 詩名'春曉'"
print(string4)

#多行字串使用三個單引號或是三個雙引號
string5 = '''    春眠不覺曉，處處聞啼鳥。
    夜來風雨聲，花落知多少。
    作者"孟浩然" 詩名"春曉"
'''
print(string5)
string6 = """    春眠不覺曉，處處聞啼鳥。
    夜來風雨聲，花落知多少。
    作者"孟浩然" 詩名"春曉"
"""
print(string6)

